;A configuration File
[XV_Pinpoint X2AbilityTemplate]
LocFriendlyName="精准射击"
LocLongDescription="使用所有可用的动作点来精准射击。额外命中增加暴击."
LocHelpText="每消耗一个行动点，命中和暴击额外增加."
LocFlyOverText="精准射击"
LocPromotionPopupText="<Bullet/> 超过100的额外命中将增加暴击.<br/><Bullet/> 精准射击也提供 <Ability:PinpointPiercing/> 穿甲和+<Ability:PinpointCritBonus/>% 暴击伤害."

[XV_PinpointDamage X2AbilityTemplate]
LocFriendlyName="精准射击"
LocLongDescription="使用所有可用的动作点来精准射击。额外命中增加暴击"
LocHelpText="每消耗一个行动点，命中和暴击额外增加"
LocFlyOverText="精准射击"

[XV_DeathAdder X2AbilityTemplate]
LocFriendlyName="死亡蝰蛇"
LocLongDescription="进行射击，对受伤敌人造成额外伤害。"
LocHelpText="死亡蝰蛇造成的额外伤害等于目标失去生命值的一半。"
LocPromotionPopupText="<Bullet/>死亡蝰蛇造成的额外伤害上限为<Ability:DeathAdderCap/>%蝰蛇步枪的正常伤害."
LocFlyOverText="死亡蝰蛇"

[XV_DeathPlus X2AbilityTemplate]
LocFriendlyName="死亡蝰蛇"
LocLongDescription="进行射击，对受伤敌人造成额外伤害。"
LocHelpText="对受伤敌人造成额外伤害。"
LocPromotionPopupText="<Bullet/> 死亡蝰蛇射击造成的额外伤害等于目标失去生命值的一半。"
LocFlyOverText="死亡蝰蛇"

[XV_Sidewinder X2AbilityTemplate]
LocFriendlyName="响尾蛇"
LocLongDescription="如果毒蛇将被敌人直接攻击命中，闪避攻击并立即移动到更好的位置。3回合冷却。"
LocLongDescription="如果毒蛇将被敌人直接攻击命中，闪避攻击并立即移动到更好的位置。3回合冷却。"
LocHelpText="如果毒蛇将被敌人直接攻击命中，闪避攻击并立即移动到更好的位置。"
LocFlyOverText="响尾蛇"
LocPromotionPopupText="<Bullet/> 如果毒蛇当前正在束缚目标，则响尾蛇不会激活。<br/><Bullet/> 响尾蛇不会对敌人反应火力触发。<br/><Bullet/> 不分青红皂白地攻击一个区域仍然可能会伤害毒蛇。

[XV_SidewinderDodge X2AbilityTemplate]
LocFriendlyName="响尾蛇"
LocLongDescription="毒蛇需要休息一下才能再次闪避攻击。"
LocHelpText="毒蛇需要休息一下才能再次闪避攻击。"

; Basically copies of XV_SidewinderDodge
; These exists to catch fringe cases with XV_SidewinderDodge
[XV_SidewinderMove X2AbilityTemplate]
LocFriendlyName="响尾蛇"
LocLongDescription="毒蛇需要休息一下才能再次闪避攻击。"
LocHelpText="毒蛇需要休息一下才能再次闪避攻击。"

[XV_SidewinderCooldown X2AbilityTemplate]
LocFriendlyName="响尾蛇"
LocLongDescription="毒蛇需要休息一下才能再次闪避攻击。"
LocHelpText="毒蛇需要休息一下才能再次闪避攻击。"

[XV_Snakebite X2AbilityTemplate]
LocFriendlyName="蛇咬"
LocLongDescription="在束缚目标时注入一剂毒液。"
LocHelpText="使被束缚的目标中毒。"
LocFlyOverText="蛇咬"
LocPromotionPopupText="<Bullet/> 蛇咬会随着毒液喷射能力的升级而升级。"

[XV_Entwine X2AbilityTemplate]
LocFriendlyName="缠绕"
LocLongDescription="紧紧包裹被束缚的目标，增加毒蛇的防御和束缚伤害。"
LocHelpText="在束缚时给予 +<Ability:EntwineDefense/> 的防御加成，并提高舌头拉扯命中 <Ability:EntwineAim/>。"
LocFlyOverText="缠绕"
LocPromotionPopupText="<Bullet/> 缠绕将基础束缚和压碎伤害提高 <Ability:EntwineDamage/>，并在束缚目标时提供 <Ability:EntwineDefense/> 防御。<br><Bullet/> 毒蛇的舌头拉扯能力将获得 <Ability:EntwineAim/> 命中加成。"

[XV_Frostbite X2AbilityTemplate]
LocFriendlyName="冰霜吐息"
LocLongDescription="喷出一团冰冷的气体，冻结区域内的目标。"
LocHelpText="冻结圆形区域内的目标。"
LocFlyOverText="冰霜吐息"
LocPromotionPopupText="<Bullet/> 冰霜吐息具有 <Ability:SelfCooldown/> 回合冷却时间。<br><Bullet/> 冰霜吐息与毒液喷射共享冷却计时器。"

[XV_Ambush X2AbilityTemplate]
LocFriendlyName="伏击"
LocLongDescription="从隐蔽状态中暴露出来时立即进入监视状态。"
LocHelpText="从隐蔽状态中暴露出来时立即进入监视状态。"
LocFlyOverText="伏击"
LocPromotionPopupText="<Bullet/> 伏击仍然受到反应射击的命中惩罚的影响。"

[XV_Ambush_CF X2AbilityTemplate]
LocFriendlyName="伏击"
LocLongDescription="当这个单位从隐蔽状态中暴露出来时，立即对敌人进行反应射击。"
LocHelpText="当这个单位从隐蔽状态中暴露出来时，立即对敌人进行反应射击。"
LocFlyOverText="伏击"
LocPromotionPopupText="<Bullet/> 伏击仍然受到反应射击的命中惩罚的影响。<br/>"

[XV_Rattle X2AbilityTemplate]
LocFriendlyName="响尾"
LocLongDescription="敌人在毒蛇从隐蔽状态中暴露出来时可能会恐慌。"
LocHelpText="敌人在毒蛇从隐蔽状态中暴露出来时可能会恐慌。"
LocFlyOverText="响尾"
LocPromotionPopupText="<Bullet/> 视线内的非机器敌人在毒蛇暴露时有 <Ability:RattlePanicChance/>% 的几率恐慌。"

[XV_RattlePanic X2AbilityTemplate]
LocFriendlyName="响尾"
LocLongDescription="敌人在毒蛇从隐蔽状态中暴露出来时可能会恐慌。"
LocHelpText="敌人在毒蛇从隐蔽状态中暴露出来时可能会恐慌。"
LocFlyOverText="响尾"
LocPromotionPopupText="<Bullet/> 视线内的非机器敌人在毒蛇暴露时有 <Ability:RattlePanicChance/>% 的几率恐慌。"

[XV_ViperCoil X2AbilityTemplate]
LocFriendlyName="盘绕"
LocLongDescription="毒蛇紧紧盘绕身体，在掩体后获得 <Ability:CoilDefense/> 防御，并在下一回合额外行动一次。"
LocHelpText="在掩体中获得防御加成，然后在下一回合开始时额外行动一次。"
LocPromotionPopupText="<Bullet/> 下一回合第一次使用毒蛇步枪射击不会结束毒蛇的回合。"

[XV_Crypsis X2AbilityTemplate]
LocFriendlyName="隐匿"
LocLongDescription="表现得像平常一样...只要没人仔细看，你就可以在敌军附近潜行。"
LocHelpText="当不与敌军直接接触时立即进入隐蔽状态。"
LocFlyOverText="隐匿"
LocPromotionPopupText="<Bullet/> 如果毒蛇处于战斗激烈的地方，隐匿将不会有效。<br><Bullet/> 在敌人面前停留 <Ability:CrypsisTime/> 回合后，隐蔽状态将消失。"

[XV_ThermalSense X2AbilityTemplate]
LocFriendlyName="热感应"
LocLongDescription="毒蛇能够探测到敌人士兵的热量特征，使其能够在敌人掩体或装甲后更好地瞄准。"
LocHelpText="敌人掩体对毒蛇的攻击提供的加成减少。"
LocFlyOverText="热感应"

[XV_PoisonSpit X2AbilityTemplate]
LocFriendlyName="毒液喷射"
LocLongDescription="毒蛇能够在远距离喷射一股毒液，爆炸成一团有毒的云雾。"
LocHelpText="向一个区域喷射致命的毒液。"
LocFlyOverText="毒液喷射"
LocPromotionPopupText="<Bullet/> 喷出一团毒液，造成 3 点伤害<br/><Bullet/> 1-5 回合后消失.<br/>"


[X2Effect_ViperFreeze]
LargeUnitFreezeLostFly="解冻：失去行动点"

[ViperThermalSenseUnlock X2SoldierAbilityUnlockTemplate]
DisplayName = "毒蛇：热感应"
Summary = "敌人掩体和装甲对毒蛇的有效性降低。"


[BreakthroughViperRifleDamage X2TechTemplate]
DisplayName="改进毒蛇步枪"
Summary="对光束聚焦的新理解使我们能够减少毒蛇步枪等离子散射，将伤害输出提高 +1。"

[BreakthroughViperRifleWeaponUpgrade X2TechTemplate]
DisplayName="模块化毒蛇步枪"
Summary="我们对外星技术的理解突破使我们能够安全地为毒蛇步枪定制一个额外的升级插槽。"


; -------------------------------------
; Playable Advent localization override
; -------------------------------------
; Snake references yo

[X2AbilitySet_Aliens.PA_EnhancedSpit X2AbilityTemplate] [PA_EnhancedSpit X2AbilityTemplate]
+LocFriendlyName="Neurotoxin"


; -------------------------------------
; Viper class titles
; -------------------------------------
;
; Alternate unit/class description?
; "这些反叛的毒蛇擅长利用它们与生俱来的生物武器快速中和敌对目标。我们也可以指挥它们在渗透角色中，从敌人后方发动致命伏击。"

[ViperClass2 X2SoldierClassTemplate]
+DisplayName = "毒蛇怪"
+ClassSummary= "毒蛇怪是一种敏捷而致命的外星单位，通常适用于连打带跑战术。毒蛇可以使用它们的舌头拉扯能力将单位从掩体中拉出来，然后使用束缚和压碎使它们丧失行动能力。"
+LeftAbilityTreeTitle = "打击者"
+RightAbilityTreeTitle = "捕食者"
AbilityTreeTitles[0]="打击者"
AbilityTreeTitles[1]="捕食者"
AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
RandomNickNames[0]="顶点"
RandomNickNames[1]="王牌"
RandomNickNames[2]="余波"
RandomNickNames[3]="阿尔法"
RandomNickNames[4]="黑杰克"
RandomNickNames[5]="靶心"
RandomNickNames[6]="螺栓"
RandomNickNames[7]="大枪手"
RandomNickNames[8]="长眠"
RandomNickNames[9]="大时刻"
RandomNickNames[10]="老板"
RandomNickNames[11]="靶心"
RandomNickNames[12]="将军"
RandomNickNames[13]="酋长"
RandomNickNames[14]="柯尔特"
RandomNickNames[15]="达拉斯"
RandomNickNames[16]="死锁"
RandomNickNames[17]="神枪手"
RandomNickNames[18]="僵局"
RandomNickNames[19]="枯木"
RandomNickNames[20]="死亡现场"
RandomNickNames[21]="鹰眼"
RandomNickNames[22]="八球"
RandomNickNames[23]="停摆"
RandomNickNames[24]="比赛时间"
RandomNickNames[25]="匪徒"
RandomNickNames[26]="掘墓人"
RandomNickNames[27]="帽子戏法"
RandomNickNames[28]="鹰眼"
RandomNickNames[29]="加热器"
RandomNickNames[30]="正午时分"
RandomNickNames[31]="杀手"
RandomNickNames[32]="好莱坞"
RandomNickNames[33]="炒作"
RandomNickNames[34]="偶像"
RandomNickNames[35]="豺狼"
RandomNickNames[36]="法官"
RandomNickNames[37]="熄灯"
RandomNickNames[38]="封锁"
RandomNickNames[39]="远射"
RandomNickNames[40]="长行者"
RandomNickNames[41]="针"
RandomNickNames[42]="苍白骑士"
RandomNickNames[43]="猎人"
RandomNickNames[44]="擦伤"
RandomNickNames[45]="连环"
RandomNickNames[46]="警长"
RandomNickNames[47]="射手"
RandomNickNames[48]="表演时间"
RandomNickNames[49]="圆滑"
RandomNickNames[50]="投掷者"
RandomNickNames[51]="冷血"
RandomNickNames[52]="清道夫"
RandomNickNames[53]="小子"
RandomNickNames[54]="真相"
RandomNickNames[55]="墓碑"
RandomNickNames[56]="顶级"
RandomNickNames[57]="顶层"
RandomNickNames[58]="两击"
RandomNickNames[59]="送葬者"
RandomNickNames[60]="情人节" 

RandomNickNames_Female[0]="男爵夫人"
RandomNickNames_Female[1]="黑寡妇"
RandomNicknames_Female[2]="灾难"
RandomNicknames_Female[3]="蜜蜂女王"
RandomNicknames_Female[4]="诱惑者"
RandomNicknames_Female[5]="蛇"
RandomNicknames_Female[6]="沉默"
RandomNicknames_Female[7]="镇静剂"
RandomNicknames_Female[8]="娜迦"
RandomNicknames_Female[9]="拉弥亚"
RandomNicknames_Female[10]="有毒的"
RandomNicknames_Female[11]="潜行者"
RandomNicknames_Female[12]="爱抚"
RandomNicknames_Female[13]="毒牙"
RandomNicknames_Female[14]="毒液"
RandomNicknames_Female[15]="幸福"
RandomNicknames_Female[16]="冰冷无情"
RandomNicknames_Female[17]="杀手皇后"
RandomNicknames_Female[18]="无法呼吸"
RandomNicknames_Female[19]="龙"
RandomNicknames_Female[20]="九头蛇"
RandomNicknames_Female[21]="女猎人"
RandomNicknames_Female[22]="捕兽夹" 

PhotoboothSoloBLines_Female[0]="远程死亡"
PhotoboothSoloBLines_Female[1]="尽管逃跑。你只会累死。"
PhotoboothSoloBLines_Female[2]="杀手皇后"
PhotoboothSoloBLines_Female[3]="正中眉心"
PhotoboothSoloBLines_Female[4]="她唯一感觉到的是后坐力"
PhotoboothSoloBLines_Female[5]="一枪一杀。"
PhotoboothSoloBLines_Female[6]="一枪一杀。不靠运气，全靠技巧。"
PhotoboothSoloBLines_Female[7]="忍耐是苦涩的，但它的果实是甜美的。"
PhotoboothSoloBLines_Female[8]="保证送达。"
PhotoboothSoloBLines_Female[9]="省子弹。用毒蛇。"
PhotoboothSoloBLines_Female[10]="成为武器。" 

[X2Photobooth]
+m_arrAnimationPoses=(AnimationDisplayName="毒蛇怪1号")
+m_arrAnimationPoses=(AnimationDisplayName="裸露的獠牙")